mesh/foamyHexMesh/elbowFoamy/system/meshDict.geometry
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          meshDict.geometry;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

joinedNetgen.stl
{
    name joinedNetgen;
    type triSurfaceMesh;

    regions
    {
        inletLarge
        {
            name inletLarge;
        }

        inletSmall
        {
            name inletSmall;
        }

        outlet
        {
            name outlet;
        }

        wallLarge
        {
            name wallLarge;
        }
        
        wallSmall
        {
            name wallSmall;
        }
    }
}


// ************************************************************************* //
