mesh/foamyHexMesh/elbowFoamy/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

joinedNetgen.stl
{
    extractionMethod        extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle       120;
    }

    subsetFeatures
    {
        // Keep nonManifold edges (edges with >2 connected faces where
        // the faces form more than two different normal planes)
        nonManifoldEdges    no;

        // Keep open edges (edges with 1 connected face)
        openEdges           no;
    }

    // Write options

        writeObj            no;
}

// ************************************************************************* //
